{"keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow", "config": {"layers": [{"class_name": "Conv2D", "config": {"activation": "relu", "kernel_size": [6, 6], "dtype": "float32", "padding": "valid", "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 96, "batch_input_shape": [null, 64, 64, 3], "trainable": true, "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"activation": "relu", "kernel_size": [4, 4], "filters": 256, "padding": "valid", "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "name": "conv2d_2", "trainable": true, "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2"}}, {"class_name": "Conv2D", "config": {"activation": "relu", "kernel_size": [3, 3], "filters": 384, "padding": "valid", "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "name": "conv2d_3", "trainable": true, "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "dense_1", "trainable": true, "bias_constraint": null, "units": 512, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_1", "noise_shape": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "dense_2", "trainable": true, "bias_constraint": null, "units": 256, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_2", "noise_shape": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "dense_3", "trainable": true, "bias_constraint": null, "units": 1, "kernel_regularizer": null}}], "name": "sequential_1"}}